{
  "welcome": "Bienvenido",
  "description": "",
  "switchToLightMode": "Cambiar a modo claro",
  "switchToDarkMode": "Cambiar a modo oscuro",
  "switchToSpanish": "Cambiar a Español",
  "switchToEnglish": "Cambiar a Inglés",
  "aboutMe": "Soy un desarrollador Full Stack apasionado por la tecnología, la innovación y los desafíos.",
  "sendEmail": "Enviar correo",
  "copyEmail": "Copiar email",
  "copied": "¡Copiado!",
  "experience": "Experiencia",
  "experienceItems": [
    {
      "id": 1,
      "title": "FP Dual - FCT",
      "company": "VIEWNEXT",
      "period": "Enero 2025 - Junio 2025",
      "description": [
        "Desarrollo de un proyecto en equipo como parte de la formación práctica, aplicando metodologías ágiles.",
        "Uso de tecnologías como Spring Boot, Angular y Tailwind CSS para el desarrollo de aplicaciones web.",
        "Gestión de bases de datos MySQL mediante el uso de contenedores Docker.",
        "Despliegue de aplicaciones en AWS."
      ]
    },
    {
      "id": 2,
      "title": "FP Dual",
      "company": "VIEWNEXT",
      "period": "Abril 2024 - Junio 2024",
      "description": [
        "Formación práctica en desarrollo web utilizando Spring Boot y JavaScript.",
        "Adquisición y aplicación de tecnologías complementarias para el desarrollo full stack."
      ]
    }
  ],
  "projects": "Proyectos",
  "scrollToImage": "Desplazar la imagen",
  "theEnigmaCasinoDescription": "Desarrollo Full Stack de una plataforma online multijugador que ofrece juegos clásicos de casino como Blackjack, Póker, Ruleta y otros mini juegos. Permite partidas en tiempo real entre jugadores mediante WebSockets, con interacción directa, diseño moderno y una experiencia de usuario inmersiva. Proyecto desarrollado como TFG.",
  "autoNextCodeDescription": "Desarrollo Full Stack de una plataforma web para la gestión y reserva de puntos de carga para vehículos eléctricos en entornos corporativos. Permite realizar reservas avanzadas según centro, planta, cargador, horario o vehículo, con control de asistencia, gestión de inasistencias, autenticación segura y panel de administración con informes. Proyecto realizado durante mi FCT en Viewnext.",
  "vhyperGamesDescription": "Desarrollo Full Stack en una tienda online de videojuegos con funcionalidades completas, desde el diseño en Figma hasta la puesta en producción. Incluye sistema de pagos con Stripe y MetaMask, panel de administración, autenticación segura y análisis de reseñas con inteligencia artificial.",
  "webpifyDescription": "Herramienta de línea de comandos desarrollada en Node.js que convierte imágenes PNG, JPG, HEIC y HEIF al formato WebP optimizado para la web. Facilita la compresión sin pérdida para mejorar los tiempos de carga. Paquete de código abierto con más de 150 descargas en npm.",
  "education": "Formación",
  "certifications": "Certificaciones",
  "technicalSuperiorWebDev": "Técnico superior en Desarrollo de aplicaciones web",
  "technicalTelecomInstallations": "Técnico en Instalaciones de Telecomunicaciones",
  "february": "Febrero",
  "aboutMeTitle": "Sobre mí",
  "technologies": "Tecnologías",
  "others": "Otros",
  "footer.github.cta": "Para ver más proyectos, visita mi GitHub.",
  "thanks": "¡Gracias por visitar mi portfolio!",
  "error": "Oops... No pudimos encontrar esta página.",
  "goBackHome": "Volver al inicio",
  "viewDetails": "Ver detalles",
  "theEnigmaCasinoFeatures": [
    "Plataforma online multijugador con juegos clásicos de casino: Blackjack, Póker, Ruleta y mini juegos",
    "Partidas en tiempo real entre jugadores mediante WebSockets con interacción directa",
    "Diseño moderno y experiencia de usuario inmersiva, accesible desde cualquier dispositivo",
    "Sistema de pagos en euros con Stripe (modo prueba) y en Ethereum vía MetaMask (red de prueba Ephemery)",
    "Retiros de fichas simulados en Ethereum a través de MetaMask y la red de prueba Ephemery",
    "API RESTful",
    "Historial completo de partidas para cada usuario",
    "Sistema de notificaciones y control de estados en tiempo real",
    "Chat en tiempo real e invitaciones para jugar con amigos",
    "Sistema de amistad para conectar y gestionar amigos dentro de la plataforma",
    "Panel de administración avanzado para gestión de usuarios y paquetes de fichas",
    "Ofertas especiales en paquetes de fichas para incentivar compras",
    "Sistema de autoexpulsión para promover el juego responsable",
    "Gachapón con recompensas aleatorias",
    "Minijuego secreto estilo Dino de Google con mascota propia",
    "Instalación como PWA para uso offline y mejor experiencia móvil",
    "Despliegue completo en AWS y plataformas en la nube",
    "Frontend y backend desarrollados desde cero con diseño completo en Figma",
    "Lógica multijugador robusta para control de partidas y estados",
    "Transacciones de prueba para garantizar seguridad sin riesgo financiero real"
  ],
  "autoNextCodeFeatures": [
    "Reserva de puntos de carga según centro, planta, cargador, horario y vehículo",
    "Control de asistencia y gestión de inasistencias a reservas",
    "Autenticación segura para acceso personalizado",
    "Panel de administración con generación de informes",
    "Vista de administración para gestión de plantas, plazas, configuraciones y usuarios",
    "Sistema de baneos para usuarios con comportamiento indebido",
    "Panel personal con gráficas sobre tus reservas",
    "Historial completo de reservas accesible para cada usuario",
    "Descarga de gráficas en PDF desde el panel de usuario y la vista de administrador",
    "Envío automático de correos electrónicos para notificaciones importantes",
    "Interfaz intuitiva para la gestión de reservas en entornos corporativos",
    "Gestión personalizada de vehículos asociados a cada usuario",
    "Gestión detallada de incidencias con distintos tipos clasificados",
    "Sistema de sanciones para la gestión y control de incumplimientos"
  ],
  "vhyperGamesFeatures": [
    "Integración de pagos en euros con Stripe y en Ethereum usando MetaMask en el navegador",
    "Panel de administración avanzado para la gestión completa de productos y usuarios",
    "Implementación de inteligencia artificial para análisis y clasificación de reseñas de usuarios",
    "Autenticación y autorización seguras utilizando JSON Web Tokens (JWT)",
    "Desarrollo completo desde el diseño en Figma hasta la puesta en producción",
    "Carrito persistente con fusión automática tras iniciar sesión",
    "Barra de búsqueda inteligente para videojuegos y en la vista administración",
    "Historial de compras",
    "Envío automático de correos electrónicos tras cada compra"
  ],
  "webpifyFeatures": [
    "Conversión de imágenes a WebP desde el terminal",
    "Soporte para múltiples formatos (PNG, JPG, HEIC, HEIF)",
    "Formato WebP optimizado para uso en web",
    "Compresión sin pérdida",
    "Open-source "
  ],
  "features": "Características",
  "webpifyExtraInfo": "Para instalar webpify-cli, ejecuta este comando en tu terminal:  npm i -g webpify-cli",
  "webpifyCommandHelper": "Para instalar Webpify CLI, ejecuta este comando en tu terminal.",
  "webpifyRunHelper": "Para ejecutar Webpify, utiliza el siguiente comando:",
  "instructions": "Instrucciones"
}
