{
  "welcome": "Bienvenido",
  "description": "",
  "switchToLightMode": "Cambiar a modo claro",
  "switchToDarkMode": "Cambiar a modo oscuro",
  "switchToSpanish": "Cambiar a Español",
  "switchToEnglish": "Cambiar a Inglés",
  "aboutMe": "Soy un desarrollador Full Stack apasionado por la tecnología, la innovación y los desafíos.",
  "sendEmail": "Enviar correo",
  "copyEmail": "Copiar email",
  "copied": "¡Copiado!",
  "experience": "Experiencia",
  "experienceItems": [
    {
      "id": 1,
      "title": "FP Dual - FCT",
      "company": "VIEWNEXT",
      "period": "Enero 2025 - Junio 2025",
      "description": [
        "Desarrollo de un proyecto en equipo como parte de la formación práctica, aplicando metodologías ágiles.",
        "Uso de tecnologías como Spring Boot, Angular y Tailwind CSS para el desarrollo de aplicaciones web.",
        "Gestión de bases de datos MySQL mediante el uso de contenedores Docker.",
        "Despliegue de aplicaciones en AWS."
      ]
    },
    {
      "id": 2,
      "title": "FP Dual",
      "company": "VIEWNEXT",
      "period": "Abril 2024 - Junio 2024",
      "description": [
        "Formación práctica en desarrollo web utilizando Spring Boot y JavaScript.",
        "Adquisición y aplicación de tecnologías complementarias para el desarrollo full stack."
      ]
    }
  ],
  "projects": "Proyectos",
  "scrollToImage": "Desplazar la imagen",
  "theEnigmaCasinoDescription": "Desarrollo Full Stack de una plataforma online multijugador que ofrece juegos clásicos de casino como Blackjack, Póker, Ruleta y otros mini juegos. Permite partidas en tiempo real entre jugadores mediante WebSockets, con interacción directa, diseño moderno y una experiencia de usuario inmersiva. Proyecto desarrollado como TFG.",
  "autoNextCodeDescription": "Desarrollo Full Stack de una plataforma web para la gestión y reserva de puntos de carga para vehículos eléctricos en entornos corporativos. Permite realizar reservas avanzadas según centro, planta, cargador, horario o vehículo, con control de asistencia, gestión de inasistencias, autenticación segura y panel de administración con informes. Proyecto realizado durante mi FCT en Viewnext.",
  "vhyperGamesDescription": "Desarrollo Full Stack en una tienda online de videojuegos con funcionalidades completas, desde el diseño en Figma hasta la puesta en producción. Incluye sistema de pagos con Stripe y MetaMask, panel de administración, autenticación segura y análisis de reseñas con inteligencia artificial.",
  "webpifyDescription": "Herramienta de línea de comandos desarrollada en Node.js que convierte imágenes PNG, JPG, HEIC y HEIF al formato WebP optimizado para la web. Facilita la compresión sin pérdida para mejorar los tiempos de carga. Paquete de código abierto con más de 150 descargas en npm.",
  "education": "Formación",
  "certifications": "Certificaciones",
  "technicalSuperiorWebDev": "Técnico superior en Desarrollo de aplicaciones web",
  "technicalTelecomInstallations": "Técnico en Instalaciones de Telecomunicaciones",
  "february": "Febrero"
}
