{
  "welcome": "Welcome",
  "description": "",
  "switchToLightMode": "Switch to light mode",
  "switchToDarkMode": "Switch to dark mode",
  "switchToSpanish": "Switch to Spanish",
  "switchToEnglish": "Switch to English",
  "aboutMe": "I’m a Full Stack developer passionate about technology, innovation and challenges.",
  "sendEmail": "Send email",
  "copyEmail": "Copy email",
  "copied": "Copied!",
  "experience": "Experience",
  "experienceItems": [
    {
      "id": 1,
      "title": "Dual Training and Internship (FCT)",
      "company": "VIEWNEXT",
      "period": "January 2025 - June 2025",
      "description": [
        "Development of a team project as part of practical training, applying agile methodologies.",
        "Use of technologies such as Spring Boot, Angular, and Tailwind CSS for web application development.",
        "Management of MySQL databases using Docker containers.",
        "Deployment of applications on AWS."
      ]
    },
    {
      "id": 2,
      "title": "Dual Vocational Training ",
      "company": "VIEWNEXT",
      "period": "April 2024 - June 2024",
      "description": [
        "Practical training in web development using Spring Boot and JavaScript.",
        "Acquisition and application of complementary technologies for full-stack development."
      ]
    }
  ],
  "projects": "Projects",
  "scrollToImage": "Scroll to image",
  "theEnigmaCasinoDescription": "Full Stack development of an online multiplayer platform featuring classic casino games such as Blackjack, Poker, Roulette, and various mini-games. Supports real-time matches between players through WebSockets, with direct interaction, modern design, and an immersive user experience. Project developed as part of my Final Degree Project.",
  "autoNextCodeDescription": "Full Stack development of a web platform for managing and booking electric vehicle charging stations in corporate environments. Supports advanced reservations based on location, floor, charger, schedule, or vehicle, with attendance control, absence management, secure authentication, and an admin panel with reporting features. Project developed during my internship (FCT) at Viewnext.",
  "vhyperGamesDescription": "Full Stack development of an online video game store with complete features, from design in Figma to production deployment. Includes payment system with Stripe and MetaMask, admin panel, secure authentication, and AI-powered review analysis.",
  "webpifyDescription": "Command-line tool developed in Node.js that converts PNG, JPG, HEIC, and HEIF images to optimized WebP format for the web. Enables lossless compression to improve loading times. Open-source npm package with over 300 downloads.",
  "education": "Education ",
  "certifications": "Certifications",
  "technicalSuperiorWebDev": "Higher Technician in Web Application Development",
  "technicalTelecomInstallations": "Telecommunications Installation Technician",
  "february": "February",
  "aboutMeTitle": "About Me",
  "technologies": "Technologies",
  "others": "Others",
  "footer.github.cta": "To see more projects, visit my GitHub.",
  "thanks": "Thanks for visiting my portfolio!",
  "error": "Oops... We couldn't find this page.",
  "goBackHome": "Return to homepage",
  "viewDetails": "View details",
  "theEnigmaCasinoFeatures": [
    "Online multiplayer platform with classic casino games: Blackjack, Poker, Roulette, and mini games",
    "Real-time matches between players using WebSockets with direct interaction",
    "Modern design and immersive user experience, accessible from any device",
    "Payment system in euros with Stripe (test mode) and Ethereum via MetaMask (Ephemery testnet)",
    "Simulated chip withdrawals in Ethereum through MetaMask and the Ephemery testnet",
    "RESTful API",
    "Complete match history for each user",
    "Real-time notifications and state management system",
    "Real-time chat and invitations to play with friends",
    "Friendship system to connect and manage friends within the platform",
    "Advanced admin panel for managing users and chip packages",
    "Special offers on chip packages to encourage purchases",
    "Auto-expulsion system to promote responsible gaming",
    "Gachapon with random rewards",
    "Secret mini-game similar to Google’s Dino game with a custom mascot",
    "PWA installation for offline use and better mobile experience",
    "Full deployment on AWS and cloud platforms",
    "Frontend and backend developed from scratch with complete design in Figma",
    "Robust multiplayer logic for match and state control",
    "Test transactions to ensure security without real financial risk"
  ],
  "autoNextCodeFeatures": [
    "Reservation of charging points by center, floor, charger, schedule, and vehicle",
    "Attendance control and management of no-shows for reservations",
    "Secure authentication for personalized access",
    "Admin panel with report generation",
    "Admin view for managing floors, parking spots, settings, and users",
    "User banning system for misconduct",
    "Personal dashboard with graphs about your reservations",
    "Complete reservation history accessible to each user",
    "Downloadable graphs in PDF from user dashboard and admin view",
    "Automatic email notifications for important alerts",
    "Intuitive interface for reservation management in corporate environments",
    "Personalized management of vehicles associated with each user",
    "Detailed incident management with classified incident types",
    "Sanction system for managing and controlling violations"
  ],
  "vhyperGamesFeatures": [
    "Integration of payments in euros via Stripe and in Ethereum using MetaMask in the browser",
    "Advanced admin panel for complete management of products and users",
    "Implementation of artificial intelligence for analysis and classification of user reviews",
    "Secure authentication and authorization using JSON Web Tokens (JWT)",
    "Full development from Figma design to production deployment",
    "Persistent shopping cart with automatic merging after login",
    "Smart search bar for video games and in the admin view",
    "Purchase history",
    "Email notifications sent automatically after each purchase"
  ],
  "webpifyFeatures": [
    "Fast and efficient conversion of images to WebP format.",
    "Support for PNG, JPG, HEIC, and HEIF.",
    "Default language: English, with an option to switch to Spanish using --es.",
    "Automatic mode (--auto) to process all images in the current folder without user interaction.",
    "Interactive mode with step-by-step guidance in the terminal.",
    "Full control of input and output paths with --input and --output.",
    "Informative commands: --help, --version, and --about.",
    "Image optimization to improve website performance.",
    "Clear and intuitive CLI with customizable flags.",
    "Open-source and available on npm and GitHub."
  ],
  "features": "Features",
  "webpifyExtraInfo": "To install webpify-cli, run this command in your terminal:  npm i -g webpify-cli",
  "webpifyCommandHelper": "To install Webpify CLI, run this command in your terminal.",
  "webpifyRunHelper": "To run Webpify, use the following command:",
  "instructions": "Instructions"
}
